RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_uart.c
static uint8_t _cyhal_uart_best_oversample(const cyhal_resource_inst_t *resource, uint32_t baudrate)
{
    uint8_t best_oversample = _CYHAL_UART_OVERSAMPLE_MIN;
    uint8_t best_difference = 0xFF;

    for (uint8_t i = _CYHAL_UART_OVERSAMPLE_MIN; i < _CYHAL_UART_OVERSAMPLE_MAX + 1; i++)
    {
        uint32_t divider = _cyhal_utils_divider_value(resource, baudrate * i, 0);
        uint8_t difference = (uint8_t)_cyhal_uart_baud_perdif(baudrate, _cyhal_uart_actual_baud(resource, divider, i));

        if (difference < best_difference)
        {
            best_difference = difference;
            best_oversample = i;
        }
    }

    return best_oversample;
}

static cy_rslt_t _cyhal_uart_setup_resources(cyhal_uart_t *obj, cyhal_gpio_t tx, cyhal_gpio_t rx, cyhal_gpio_t cts,
                                             cyhal_gpio_t rts, const cyhal_clock_t *clk)
{
    cy_rslt_t result;

    // Explicitly marked not allocated resources as invalid to prevent freeing them.
    obj->resource.type = CYHAL_RSC_INVALID;
    obj->is_clock_owned = false;
    obj->pin_rx = CYHAL_NC_PIN_VALUE;
    obj->pin_tx = CYHAL_NC_PIN_VALUE;
    obj->pin_cts = CYHAL_NC_PIN_VALUE;
    obj->pin_rts = CYHAL_NC_PIN_VALUE;

    uint32_t saved_intr_status = cyhal_system_critical_section_enter();
    // pins_blocks will contain bit representation of blocks, that are connected to specified pin
    // 1 block - 1 bit, so, for example, pin_blocks = 0x00000006 means that certain pin
    // can belong to next non-reserved blocks SCB2 and SCB1
    uint32_t pins_blocks = _CYHAL_SCB_CHECK_AFFILIATION(tx, cyhal_pin_map_scb_uart_tx);
    pins_blocks &= _CYHAL_SCB_CHECK_AFFILIATION(rx, cyhal_pin_map_scb_uart_rx);
    if (NC != cts)
    {
        pins_blocks &= _CYHAL_SCB_CHECK_AFFILIATION(cts, cyhal_pin_map_scb_uart_cts);
    }
    if (NC != rts)
    {
        pins_blocks &= _CYHAL_SCB_CHECK_AFFILIATION(rts, cyhal_pin_map_scb_uart_rts);
    }
    // One (or more) pin does not belong to any SCB instance or all corresponding SCB instances
    // are reserved
    if (0 == pins_blocks)
    {
        cyhal_system_critical_section_exit(saved_intr_status);
        return CYHAL_UART_RSLT_ERR_INVALID_PIN;
    }

    uint8_t found_block_idx = 0;
    while(((pins_blocks >> found_block_idx) & 0x1) == 0)
    {
        found_block_idx++;
    }

    cyhal_resource_inst_t uart_rsc = { CYHAL_RSC_SCB, found_block_idx, 0 };

    // Reserve the UART
    const cyhal_resource_pin_mapping_t *tx_map = _CYHAL_SCB_FIND_MAP_BLOCK(tx, cyhal_pin_map_scb_uart_tx, &uart_rsc);
    const cyhal_resource_pin_mapping_t *rx_map = _CYHAL_SCB_FIND_MAP_BLOCK(rx, cyhal_pin_map_scb_uart_rx, &uart_rsc);
    const cyhal_resource_pin_mapping_t *cts_map = _CYHAL_SCB_FIND_MAP_BLOCK(cts, cyhal_pin_map_scb_uart_cts, &uart_rsc);
    const cyhal_resource_pin_mapping_t *rts_map = _CYHAL_SCB_FIND_MAP_BLOCK(rts, cyhal_pin_map_scb_uart_rts, &uart_rsc);

    if (NULL == tx_map || NULL == rx_map || (NC != cts && NULL == cts_map) || (NC != rts && NULL == rts_map))
    {
        // Should never enter here, as _CYHAL_SCB_CHECK_AFFILIATION above garantee that all of these pin maps exist.
        CY_ASSERT(false);
    }

    result = cyhal_hwmgr_reserve(&uart_rsc);
    cyhal_system_critical_section_exit(saved_intr_status);
    if (CY_RSLT_SUCCESS != result)
    {
        return result;
    }

    obj->resource = uart_rsc;

    // reserve the TX pin
    result = _cyhal_utils_reserve_and_connect(tx_map, CYHAL_PIN_MAP_DRIVE_MODE_SCB_UART_TX);
    if (result == CY_RSLT_SUCCESS)
    {
        obj->pin_tx = tx;

        //reseve the RX pin
        result = _cyhal_utils_reserve_and_connect(rx_map, CYHAL_PIN_MAP_DRIVE_MODE_SCB_UART_RX);
        if (result == CY_RSLT_SUCCESS)
        {
            obj->pin_rx = rx;
        }
    }

    if ((result == CY_RSLT_SUCCESS) && (NULL != cts_map))
    {
        // reserve the CTS pin
        result = _cyhal_utils_reserve_and_connect(cts_map, CYHAL_PIN_MAP_DRIVE_MODE_SCB_UART_CTS);
        if (result == CY_RSLT_SUCCESS)
        {
            obj->cts_enabled = true;
            obj->pin_cts = cts;
        }
    }

    if ((result == CY_RSLT_SUCCESS) && (NULL != rts_map))
    {
        // reserve the RTS pin
        result = _cyhal_utils_reserve_and_connect(rts_map, CYHAL_PIN_MAP_DRIVE_MODE_SCB_UART_RTS);
        if (result == CY_RSLT_SUCCESS)
        {
            obj->rts_enabled = true;
            obj->pin_rts = rts;
        }
    }

    if (result == CY_RSLT_SUCCESS)
    {
        if (clk == NULL)
        {
            result = _cyhal_utils_allocate_clock(&(obj->clock), &obj->resource, CYHAL_CLOCK_BLOCK_PERIPHERAL_16BIT, true);
            obj->is_clock_owned = (CY_RSLT_SUCCESS == result);
        }
        else
        {
            obj->is_clock_owned = false;
            obj->clock = *clk;
        }
    }

    if (result == CY_RSLT_SUCCESS)
    {
        result = _cyhal_utils_peri_pclk_assign_divider(
            _cyhal_scb_get_clock_index(obj->resource.block_num), &(obj->clock));
    }

    return result;
}

static cy_rslt_t _cyhal_uart_init_hw(cyhal_uart_t *obj)
{
    obj->base = _CYHAL_SCB_BASE_ADDRESSES[obj->resource.block_num];

    cy_rslt_t result = (cy_rslt_t) Cy_SCB_UART_Init(obj->base, &(obj->config), &(obj->context));

    if (CY_RSLT_SUCCESS == result)
    {
        obj->callback_data.callback = NULL;
        obj->callback_data.callback_arg = NULL;
        obj->irq_cause = CYHAL_UART_IRQ_NONE;

        _cyhal_irq_register(_CYHAL_SCB_IRQ_N[obj->resource.block_num], CYHAL_ISR_PRIORITY_DEFAULT, _cyhal_uart_irq_handler);
        _cyhal_irq_enable(_CYHAL_SCB_IRQ_N[obj->resource.block_num]);

        _cyhal_scb_update_instance_data(obj->resource.block_num, (void*)obj, &_cyhal_uart_pm_callback_instance);

        Cy_SCB_UART_Enable(obj->base);
    }

    return result;
}

cy_rslt_t cyhal_uart_init(cyhal_uart_t *obj, cyhal_gpio_t tx, cyhal_gpio_t rx, cyhal_gpio_t cts, cyhal_gpio_t rts,
                          const cyhal_clock_t *clk, const cyhal_uart_cfg_t *cfg)
{
    CY_ASSERT(NULL != obj);
    memset(obj, 0, sizeof(cyhal_uart_t));

