RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-hal-cat1/source/cyhal_uart.c
    obj->dc_configured = false;
    cy_rslt_t result = _cyhal_uart_setup_resources(obj, tx, rx, cts, rts, clk);

    if (CY_RSLT_SUCCESS == result)
    {
        obj->config = _cyhal_uart_default_config;
        obj->config.enableCts = obj->cts_enabled;

        if (cfg != NULL)
        {
            obj->config.dataWidth = cfg->data_bits;
            obj->config.stopBits = _cyhal_uart_convert_stopbits((uint8_t)cfg->stop_bits);
            obj->config.parity = _cyhal_uart_convert_parity(cfg->parity);
        }

        result = _cyhal_uart_init_hw(obj);
    }

    if (CY_RSLT_SUCCESS == result)
    {
        if ((cfg != NULL) && (cfg->rx_buffer != NULL))
        {
            cyhal_uart_config_software_buffer(obj, cfg->rx_buffer, cfg->rx_buffer_size);
        }

        if (obj->is_clock_owned)
        {
            result = cyhal_uart_set_baud(obj, CYHAL_UART_DEFAULT_BAUD, NULL);
        }
    }

    if (CY_RSLT_SUCCESS != result)
    {
        cyhal_uart_free(obj);
    }
    return result;
}

cy_rslt_t cyhal_uart_init_cfg(cyhal_uart_t *obj, const cyhal_uart_configurator_t *cfg)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != cfg);
    CY_ASSERT(NULL != cfg->config);
    memset(obj, 0, sizeof(cyhal_uart_t));

    obj->resource = *cfg->resource;
    obj->clock = *cfg->clock;
    obj->is_clock_owned = false;
    obj->pin_tx = cfg->gpios.pin_tx;
    obj->pin_rts = cfg->gpios.pin_rts;
    obj->pin_cts = cfg->gpios.pin_cts;
    obj->dc_configured = true;
    obj->cts_enabled = cfg->config->enableCts;
    obj->rts_enabled = (NC != cfg->gpios.pin_rts);

    obj->config = *cfg->config;
    return _cyhal_uart_init_hw(obj);
}

void cyhal_uart_free(cyhal_uart_t *obj)
{
    CY_ASSERT(NULL != obj);

    if (NULL != obj->base)
    {
        Cy_SCB_UART_Disable(obj->base, &obj->context);
        Cy_SCB_UART_DeInit(obj->base);
        obj->base = NULL;
    }

    if (obj->resource.type != CYHAL_RSC_INVALID)
    {
        _cyhal_system_irq_t irqn = _CYHAL_SCB_IRQ_N[obj->resource.block_num];
        _cyhal_irq_free(irqn);

        _cyhal_scb_update_instance_data(obj->resource.block_num, NULL, NULL);

        if (false == obj->dc_configured)
        {
            cyhal_hwmgr_free(&(obj->resource));
        }

        obj->resource.type = CYHAL_RSC_INVALID;
    }

    if (false == obj->dc_configured)
    {
        _cyhal_utils_release_if_used(&(obj->pin_rx));
        _cyhal_utils_release_if_used(&(obj->pin_tx));
        _cyhal_utils_release_if_used(&(obj->pin_rts));
        _cyhal_utils_release_if_used(&(obj->pin_cts));

        if (obj->is_clock_owned)
        {
            cyhal_clock_free(&(obj->clock));
        }
    }
}

cy_rslt_t cyhal_uart_set_baud(cyhal_uart_t *obj, uint32_t baudrate, uint32_t *actualbaud)
{
    cy_rslt_t status;

    if (obj->is_clock_owned)
    {
        uint8_t oversample_value;
        uint32_t calculated_baud;
        uint32_t divider;

        Cy_SCB_UART_Disable(obj->base, NULL);
        status = cyhal_clock_set_enabled(&(obj->clock), false, false);
        if(status != CY_RSLT_SUCCESS)
        {
            Cy_SCB_UART_Enable(obj->base);
            return status;
        }

        oversample_value = _cyhal_uart_best_oversample(&(obj->resource), baudrate);
        obj->config.oversample = oversample_value;

        divider = _cyhal_utils_divider_value(&(obj->resource), baudrate * oversample_value, 0);

        /* Set baud rate */
        status = cyhal_clock_set_divider(&(obj->clock), divider);
        if(status != CY_RSLT_SUCCESS)
        {
            cyhal_clock_set_enabled(&(obj->clock), true, false);
            Cy_SCB_UART_Enable(obj->base);
            return status;
        }

        calculated_baud = _cyhal_uart_actual_baud(&(obj->resource), divider, oversample_value);

        if (actualbaud != NULL)
            *actualbaud = calculated_baud;
        uint32_t baud_difference = _cyhal_uart_baud_perdif(baudrate, calculated_baud);
        if (baud_difference > CYHAL_UART_MAX_BAUD_PERCENT_DIFFERENCE)
            status = CY_RSLT_WRN_CSP_UART_BAUD_TOLERANCE;

        status = cyhal_clock_set_enabled(&(obj->clock), true, false);

        /* Configure the UART interface */
        #if (CY_IP_MXSCB_VERSION >= 2) /* Versions 2 and later */
        uint32_t mem_width = (obj->config.dataWidth <= CY_SCB_BYTE_WIDTH)
            #if defined(COMPONENT_CAT1)
            ? CY_SCB_MEM_WIDTH_BYTE : CY_SCB_MEM_WIDTH_HALFWORD;
            #elif defined(COMPONENT_CAT2)
            ? CY_SCB_CTRL_MEM_WIDTH_BYTE : CY_SCB_CTRL_MEM_WIDTH_HALFWORD;
            #endif

        SCB_CTRL(obj->base) = _BOOL2FLD(SCB_CTRL_ADDR_ACCEPT, obj->config.acceptAddrInFifo)     |
                    _BOOL2FLD(SCB_CTRL_MEM_WIDTH, mem_width)                                    |
                    _VAL2FLD(SCB_CTRL_OVS, oversample_value - 1)                                |
                    _VAL2FLD(SCB_CTRL_MODE, CY_SCB_CTRL_MODE_UART);
        #else /* Older versions of the block */
        SCB_CTRL(obj->base) = _BOOL2FLD(SCB_CTRL_ADDR_ACCEPT, obj->config.acceptAddrInFifo)     |
                    _BOOL2FLD(SCB_CTRL_BYTE_MODE, (obj->config.dataWidth <= CY_SCB_BYTE_WIDTH)) |
                    _VAL2FLD(SCB_CTRL_OVS, oversample_value - 1)                                |
                    _VAL2FLD(SCB_CTRL_MODE, CY_SCB_CTRL_MODE_UART);
        #endif

        Cy_SCB_UART_Enable(obj->base);
    }
    else
    {
        /* Not able to make changes in user-provided clock */
        status = CYHAL_UART_RSLT_CLOCK_ERROR;
    }

    return status;
}

cy_rslt_t cyhal_uart_configure(cyhal_uart_t *obj, const cyhal_uart_cfg_t *cfg)
{
    CY_ASSERT(NULL != obj);
    CY_ASSERT(NULL != cfg);
    Cy_SCB_UART_Disable(obj->base, NULL);
    obj->config.dataWidth = cfg->data_bits;
    obj->config.stopBits = _cyhal_uart_convert_stopbits((uint8_t)cfg->stop_bits);
    obj->config.parity = _cyhal_uart_convert_parity(cfg->parity);
    obj->config.enableCts = obj->cts_enabled;
    // Do not pass obj->context here because Cy_SCB_UART_Init will destroy it
    Cy_SCB_UART_Init(obj->base, &(obj->config), NULL);
    Cy_SCB_UART_Enable(obj->base);
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_uart_getc(cyhal_uart_t *obj, uint8_t *value, uint32_t timeout)
{
    if (_cyhal_scb_pm_transition_pending())
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;

    uint32_t read_value = Cy_SCB_UART_Get(obj->base);
    uint32_t timeoutTicks = timeout;
    while (read_value == CY_SCB_UART_RX_NO_DATA)
    {
        if(timeout != 0UL)
        {
            if(timeoutTicks > 0UL)
            {
                Cy_SysLib_Delay(1);
                timeoutTicks--;
            }
            else
            {
                return CY_RSLT_ERR_CSP_UART_GETC_TIMEOUT;
            }
        }
        read_value = Cy_SCB_UART_Get(obj->base);
    }
    *value = (uint8_t)read_value;
    return CY_RSLT_SUCCESS;
}

cy_rslt_t cyhal_uart_putc(cyhal_uart_t *obj, uint32_t value)
{
    if (_cyhal_scb_pm_transition_pending())
        return CYHAL_SYSPM_RSLT_ERR_PM_PENDING;

    uint32_t count = 0;
    while (count == 0)
    {
        count = Cy_SCB_UART_Put(obj->base, value);
    }

    return CY_RSLT_SUCCESS;
}

uint32_t cyhal_uart_readable(cyhal_uart_t *obj)
{
    uint32_t number_available = Cy_SCB_UART_GetNumInRxFifo(obj->base);
    if(obj->context.rxRingBuf != NULL)
    {
        number_available += Cy_SCB_UART_GetNumInRingBuffer(obj->base, &(obj->context));
    }
    return number_available;
}

uint32_t cyhal_uart_writable(cyhal_uart_t *obj)
{
    return Cy_SCB_GetFifoSize(obj->base) - Cy_SCB_GetNumInTxFifo(obj->base);
}

